// 📌  📌প্রাইস

// 🏆🏆 প্রাইসঃ

// ✅ পাইথন

// 🔗 কোর

// 👋  👌 ✌️ 	☝️ 👊  💪  🍭  🧊 🏭 🔥 🎁 🎀  🎗️ 🎈 🥇 🏆 🎯 📢 🔔 💡 🏷️ ✒️ 📁 📌 🔑 🔒 🔨

//  🚫  ⛔ ❌ ©️

// 😄 Joining Link:

// ⚡ Data Source:

// 👉 Automatic Code Splitting:

// 👇 আজকের আলোচনার বিষয় হলো

//  Prisma হল একটি ওপেন-সোর্স

// ✅ একটি সহজ উদাহরণ যদি দেয়া হয়,

// 😎 হ্যালো ডেভেলপারস ,

// 🤝 সাপোর্ট ক্লাস:

// 🚀 লার্নিং রিসোর্স :

// 🎗️ কোনো প্রশ্ন থাকলে

// 🌐 এই লিঙ্কে ক্লিক করুনঃ

// https://github.com/ikatyang/emoji-cheat-sheet/blob/master/README.md#hand-fingers-open
