


/*
জাভাস্ক্রিপ্টে খুবই কনফিউজিং 🙄 এবং বিদঘুটে একটা জিনিস হচ্ছে NaN। যদি এটার কনসেপ্ট বুঝতে পারেন তাহলে এটার যেকোন প্রবলেম সল্যুশন করতে পারবেন খুব সহজে 😉।

NaN = Not a Number

এটা একটা Number তবে legal কোন নাম্বার নয় । NaN হচ্ছে জাস্ট একটা global property ।

যদি এটার টাইপ চেক করেন typeof এর মাধ্যমে তাহলে দেখতে পাবেন number
console.log(typeof NaN); // number
এটা যদি কম্পেরিজন করতে যান তাহলে দেখবেন আরেক কনফিউজিং জিনিস 🫡🤔
console.log(NaN == NaN); // false
console.log(NaN === NaN); // false
এখন আপনার এমন প্রয়োজন হতে পারে এটা কম্পেয়ার করার তাহলে কি করবেন?
সল্যুশন ২টা হতে পারে ---
১. isNaN() function দিয়ে চেক করা
২. Number.isNaN() মেথড দিয়ে চেক করা


তো আজকে জানব isNaN() এর ব্যবহার । isNaN() function আর্গুমেন্ট হিসেবে value receive করে । এই ভ্যালু যদি NaN হয় তাহলে isNaN() function true রিটার্ন করবে । আর যদি ভ্যালু NaN না হয় তাহলে false রিটার্ন করবে । এখন ভ্যালু NaN কিনা এটা চেক করা ঘুরেফিরে একই প্রবলেম । টেনশনের কোন কারন নেই আপনাকে এটা ম্যানুয়ালি চেক করে বলতে হবে না এই ভ্যালু NaN কিনা। জাভাস্ক্রিপ্ট আটোমেটিক্যালি করে দিবে । জাভাস্ক্রিপ্ট আটোমেটিক্যালি কাজ করে দেয়ার আগে আমরা জাভাস্ক্রিপ্টের Number() মেথড কে কাজে লাগিয়ে ম্যানুয়ালি চেক করি চলেন ---

console.log(Number(10)); // 10
console.log(Number('Hello')); // NaN
প্রথম উদাহরণ এ জাভাস্ক্রিপ্ট এটাকে Number এ কনভার্ট করতে পেরেছে তাই 10 রিটার্ন করেছে । পরের উদাহরণ এ এটাকে সে Number এ কনভার্ট করতে পারেনি তাই NaN রিটার্ন করেছে ।

এখন চলেন মূল কাজে ---
console.log(isNaN(10)); // false
এই উদাহরণে isNaN() ফাংশনে 10 ভ্যালু হিসেবে দেয়া হয়েছে । isNaN() ফাংশন এটাকে প্রথমে নাম্বারে করভার্ট করার ট্রাই করে । সে ভ্যালুকে নাম্বারে কনভার্ট করতে পেরেছে। যেহেতু 10 একটা নাম্বার সংখ্যা তাই false রিটার্ন করেছে। আমি আগেই বলেছি ভ্যালু যদি NaN হয় তাহলে সে true রিটার্ন করবে অন্যথায় false ।

এখন বলতে পারেন, ভাই আমার মাথায় চিকনা বুদ্ধি কম না। এত কাহিনী করার কি দরকার । এভাবে করলেই তো হয় ___

console.log(NaN == Number(10));
console.log(NaN === Number('Hello'));

কোড রান করে আমাকে জানাবেন । নিচে কিছু উদাহরণ দিয়ে দিলাম বুঝার জন্য। 


*/

