// crud project kore dekhanu

// https://webkawsar.github.io/product-cart/


আমাদের লক্ষ্য হলো কমেন্টের দেয়া লিংক এর মত জাভাস্ক্রিপ্ট দিয়ে আমরা এই `CRUD` করব

এর জন্য প্রথমে আমাদের একটু প্লানিং করে নিতে হবে। এর জন্য কয়েকটা স্টেপ এ আমাদের কাজ করতে হবে। এই স্টেপগুলোকে আবার কয়েকটা ছোট ছোট ভাগে ভাগ করে ফেলতে হবে। 


কমেন্টের দেয়া লিংক ভিজিট করে আমরা কি কি জিনিস দেখতে পাচ্ছি এখানে আছে? 

এখানে একজন ইউজার প্রোডাক্টের নাম এবং প্রাইছ দিয়ে প্রোডাক্ট সাবমিট করতে পারবে। প্রোডাক্ট সাবমিট করার পরে এই প্রোডাক্ট এর নামে উপরে লিস্ট আকারে দেখাবে। এখন কেউ চাইলে এই প্রোডাক্টকে আপডেট করতে পারবে। আবার কেউ চাইলে ডিলিট অ করে দিতে পারবে 

আপনাদের ডিজাইন নিয়ে কোন চিন্তা করতে হবে না, ডিজাইন আমাদের ফোকাস না, ডিজাইন পেয়ে যাবেন। 

আমাদের লক্ষ্য হলো কিভাবে ফাংশনালিটিস করতে হয়। 

তাহলে আমাদের স্টেপগুলো কি কি হলো -- 
1. সকল ইনপুট ফিল্ড গুলো ধরতে হবে 
2. সাবমিট বাটনকে ধরতে হবে 
3. 