// জাভাস্ক্রিপ্ট ডাটা টাইপ

// ডাটা টাইপ জানার আগে আমাদের জানতে হবে ডাটা কি জিনিস

// A JavaScript variable can hold any type of data.

// Reference / Complex Data Type
// A reference data type is a data type that does not directly contain its data but instead stores references (memory addresses) to the locations where the data is stored.

// The Object data type (non-primitive type) can store collections of data, whereas primitive data type can only store a single data.





// ========================== Article==============================

জাভাস্ক্রিপ্টে অনেক অনেক ডাটা টাইপ আছে। সমস্ত ডাটা টাইপগুলোকে যদি আমরা প্রধানত ২টা ক্যাটাগরিতে ভাগ করে ফেলি তাহলে আমাদের বুঝতে সুবিধা হবে। প্রধান ২টা ক্যাটাগরিতে ভাগ করলে ডাটা টাইপ হবেঃ

```
1. Primitive Data Type
2. Reference/Complex/Non Primitive Data Type
```

এখন আমরা জানব **Primitive Data Type** কি?  
👉 **Primitive Data Type** হচ্ছে এমন ডাটা টাইপ যেখানে **`Primitive Value`** থাকে

বুঝলাম, তাহলে আবার **Primitive Value** কি?  
👉 **Primitive Value** হচ্ছে সিঙ্গেল একটা ভ্যালু, যেই ভ্যালুর কোন `properties` এবং `methods` নেই এবং এটি `immutable` মানে এই ভ্যালুকে কোন পরিবর্তন করা যাবে না 🙃

জাভাস্ক্রিপ্ট ৭ ধরনের ডাটাকে **Primitive Data Type** হিসেবে কনসিডার করে। এগুলো হলোঃ

```
1. string
2. number
3. boolean
4. null
5. undefined
6. symbol
7. bigint
```

এখন জানব **Reference / Complex Data Type** কি?  
👉 Reference ডাটা টাইপ হচ্ছে এমন এক ধরনের ডাটা টাইপ, যে সরাসরি কোন ডাটাকে স্টোর না করে বরং মেমরীতে একটি জায়গা নির্ধারন করে **ঐ জায়গার রেফারেন্স স্টোর করে**। এক বা একাধিক ডাটা স্টোর করতে পারে বিধায় তাকে **Complex** ডাটা টাইপ ও বলা হয়।

মূলত এই তিন ধরনের ডাটাকে জাভাস্ক্রিপ্ট `Reference/Complex` ডাটা টাইপ হিসেবে কনসিডার করে।

```
1. Object
2. Array
3. Function
```

জাভাস্ক্রিপ্টে সকল `Reference/Complex` ডাটার টাইপ হচ্ছে `object`


